{"name":"Philip","headerTaglineOne":"Hello 👋","headerTaglineTwo":"I'm Philip, skier","headerTaglineThree":"Computer Engineer","headerTaglineFour":"from Surrey, Canada.","showCursor":false,"showBlog":true,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/philip-L"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/philip-leblanc-7692a5aa"},{"id":"5","title":"Email","link":"mailto:philip.leblan@gmail.com"},{"id":"a05c7a40-ec38-45f7-b876-86bed27402e0","title":"Facebook","link":"https://www.facebook.com/philawizard"}],"projects":[{"id":"1","title":"Finviz and Yahoo Finance API","description":"Jupyter notebook and blog","imageSrc":"https://th.bing.com/th/id/OIP.smBVM4U-vftFnKO4_q_2KgHaFh?rs=1&pid=ImgDetMain","url":"https://github.com/philip-L/AlgoTrading"},{"id":"2","title":"Xmodem File Transfer","description":"Design and Development","imageSrc":"https://th.bing.com/th/id/OIP.Ey3Z1cVjFRWg4xqgfqRfwwHaFA?w=218&h=180&c=7&r=0&o=5&pid=1.7","url":"https://github.com/philip-L/Xmodem-file-transfer-ENSC351"}],"services":[{"id":"496eb008-35ca-4557-8397-4964cd8f36a5","title":"Consulting","description":"Versed in all aspects of computer engineering, and passionate about technology and innovation, and how it can improve all life, with emphasis on ethical, social, governance, and circular economy."},{"id":"4ff54670-d481-4b25-8e71-b4e392ebef17","title":"Software, Firmware or Hardware Development","description":"Python, SQL, Javascript, C/C++, VHDL"},{"id":"85241eb8-db52-4894-a35c-35dc6ceebf45","title":"Business Analysis","description":"Excel, PowerBI"}],"aboutpara":"Harnessing a rich blend of theoretical knowledge from a Bachelor’s Degree in Computer Engineering and practical application, my role as a Product Developer at CopperTree Analytics honed my expertise in embedded devices and software construction. It was more than just about fulfilling requirements; it was about pushing the envelope of what was technically feasible to deliver quality features that resonate with users.\n\nIn addition, the analytical rigor I cultivated as a Silicon Validation Engineer at Intel Corporation underpins my methodical approach to product development. My fluency in both English and French positions me uniquely within diverse teams, enabling us to craft solutions that are as versatile as they are robust, navigating the entire product lifecycle with precision and adaptability.","resume":{"tagline":"👋  I'm a computer engineer, and much more.","description":"I possess an understanding of hardware design, low-level programming, as well as high-level languages relevant to all aspects of computer engineering.","experiences":[{"id":"1","dates":"February 2023 - October 2023","type":"Full Time","position":"Product Developer","bullets":"Built and tested a user activity monitor for a FastApi web application to track interaction through the app and saved user history in a database to improve understanding of user experience, Set realistic goals to refactor and develop a webpage to display hardware and network gateway device status using CoreUI orchestrated with Balena Cloud, Cron jobs, S6 process supervision, Docker"},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"September 2018 - April 2019","type":"Full Time","position":"Silicon Validation Engineer","bullets":"Implemented cycle-critical real-time C code for test cases to validate the micro-architecture of  new SSD ASIC technology using the Power Architecture Specification, Developed a python script using telnetlib to automate the power cycling for debugging efforts to  help identify a power-on error, Tested boards with state-of-the-art lab equipment and set up test machines for characterizing  and debugging newly fabricated chips, Collaborated in a large fast-paced team environment using Git and Jira and investigated the  details of PCIe to verify latency and power consumption of low-energy states"},{"id":"0e9fe48e-a2d9-4d51-aa1f-8bbb601e09e7","dates":"September 2016 - April 2017","type":"Full Time","position":"Computer Scientist","bullets":"Demonstrated proficiency in Python, and SQL by creating a python tool to delete specific entries from a Postgres backend database, Added functionality to an internal webpage using Angular.js and Python allowing entries of new  drivers into the backend database in order to have more efficient development of database drivers, Responsible for providing support to other teams and maintaining build and test features for database drivers "}],"education":[{"universityName":"Npower Canada","universityDate":"September - December 2024","universityPara":"Junior Data Analyst Program"},{"id":"f74c0f0b-483a-4c5d-aada-1d5d582a6bef","universityName":"Simon Fraser University","universityDate":"September 2014 - December 2019","universityPara":"Bachelor's of Applied Science in Computer Engineering"}],"languages":["Python","C/C++","Javascript, HTML5, CSS","VHDL"],"frameworks":["React","Typescript","NodeJs","Python"],"others":["Excel","Azure ML","IBM Cloud"]}}